main_menu = [
    'Главное меню:',
    'Открыть справочник',
    'Сохранить справочник',
    'Показать все контакты',
    'Создать контакт',
    'Найти контакт',
    'Изменить контакт',
    'Удалить контакт',
    'Выход',
]

main_menu_user_choice = 'Выберите пункт меню: '

main_menu_user_choice_error = 'Требуется ввести число от 1 до {number}'.format(number=len(main_menu) - 1)

open_file_successful = 'Телефонная книга успешно открыта!'

save_file_successful = 'Телефонная книга успешно сохранена!'

empty_phone_book = 'Телефонная книга пуста или не открыта!'

contact_create_successful = 'Контакт {name} успешно создан!'

create_new_user = [
    'Введите имя пользователя: ',
    'Введите телефон: ',
    'Введите комментарий: ',
]

input_id_to_delete = 'Введите ID контакта, который хотите удалить: '

input_key_word_to_find = 'Введите ключевое слово для поиска: '

null_search_result = 'Контакты содержащие {key_word} не найдены!'

contact_delete_successful = 'Контакт {name} успешно удален'

input_id_to_edit = 'Введите ID контакта для изменения: '

edit_user = [
    'Введите новое имя пользователя (ENTER для пропуска): ',
    'Введите новый телефон (ENTER для пропуска): ',
    'Введите новый комментарий (ENTER для пропуска): ',
]

edit_contact_successful = 'Контакт "{name}" изменен успешно!'
