menu_items = [ "Программа телефонный справочник поддерживает следующие операции: ",
               "[1] - открыть файл",
               "[2] - сохранить файл",
               "[3] - показать все контакты",
               "[4] - создать контакт",
               "[5] - найти контакт",
               "[6] - изменить контакт",
               "[7] - удалить контакт",
               "[8] - выход"
]

menu_item_choice = "Введите номер операции: "

file_opened_success = "Файл успешно открыт!"

file_saved_success = "Файл успешно сохранен!"

file_not_found = "Запрашиваемый файл не существует!"

file_not_opened = "Для работы с контактами необходимо открыть файл!"